
#Область ПрограммныйИнтерфейс
    // Задача 11.2 Дополнение формы документов
Процедура ДополнитьФорму(Форма) Экспорт 
	ИмяФормы = Форма.ИмяФормы;
	Команды = Форма.Команды;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаЛево(Форма)
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли;
КонецПроцедуры 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

	// Задача 11.2 Добавили реквизит формы КонтактноеЛицо на форму
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Нет_КонтактноеЛицо";
КонецПроцедуры

    // Задача 11.2 Вставили реквизит формы КонтактноеЛицо на форму
Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Нет_КонтактноеЛицо";
КонецПроцедуры

    // Задача 11.2 Добавили реквизиты формы Применение скидки на форму Документ ЗаказПокупателя
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаЛево(Форма);
	//Создание обычной группы без отображения
	ГруппаШапкаСкидка = Форма.Элементы.Добавить("ГруппаШапкаСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	ГруппаШапкаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаШапкаСкидка.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаШапкаСкидка.ОтображатьЗаголовок = ЛОЖЬ; 
	ГруппаШапкаСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	//Добавили реквизит формы СогласованнаяСкидка на форму
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаСкидка);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Нет_СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "Нет_СогласованнаяСкидкаПриИзменении");
	
	//Создание команды ПересчитатьДанные
	НоваяКоманда = Форма.Команды.Добавить("ПересчитатьДанные");
	НоваяКоманда.Заголовок = "Пересчитать данные табличных частей";
	НоваяКоманда.Действие = "Нет_ПересчитатьДанные"; 
	
	//Добавили кнопку ПересчитатьДанные на форму
	НовыйЭлемент = Форма.Элементы.Добавить("Кнопка", Тип("КнопкаФормы"), Форма.Элементы.ГруппаШапкаСкидка);
	НовыйЭлемент.Заголовок = "Пересчитать данные";
	НовыйЭлемент.ИмяКоманды = "ПересчитатьДанные";
КонецПроцедуры
	
#КонецОбласти